{
  "id": "/subscriptions/f007df01-9295-491c-b0e9-e3981f2df0b0/providers/Microsoft.AlertsManagement/alerts/7ca25b09-e05e-cced-606d-cc4d91d5000e/providers/Microsoft.AlertsManagement/alerts/7ca25b09-e05e-cced-606d-cc4d91d5000e",
  "name": "vpp-resource-unhealthy",
  "properties": {
    "context": {
      "context": {
        "condition": {
          "allOf": [
            {
              "dimensions": [
                {
                  "name": "_ResourceId",
                  "value": "/subscriptions/f007df01-9295-491c-b0e9-e3981f2df0b0"
                }
              ],
              "event": null,
              "failingPeriods": {
                "minFailingPeriodsToAlert": 1,
                "numberOfEvaluationPeriods": 1
              },
              "linkToFilteredSearchResultsAPI": "https://api.loganalytics.io/v1/workspaces/8bb8b1ca-9b6e-4af8-afca-6e9f1fda544a/query?query=AzureActivity%7C%20where%20%20CategoryValue%20%3D%3D%20%22ServiceHealth%22&timespan=2026-05-11T12%3a52%3a07.0000000Z%2f2026-05-11T12%3a57%3a07.0000000Z",
              "linkToFilteredSearchResultsUI": "https://portal.azure.com#@eca36054-49a9-4731-a42f-8400670fc022/blade/Microsoft_Azure_Monitoring_Logs/LogsBlade/source/Alerts.EmailLinks/scope/%7B%22resources%22%3A%5B%7B%22resourceId%22%3A%22%2Fsubscriptions%2Ff007df01-9295-491c-b0e9-e3981f2df0b0%22%7D%5D%7D/q/eJxzrCotSnVMLsksyyyprFEoz0gtSlVQcE4sSU3PL6oMS8wpTVWwtVVQCk4tKstMTvVITcwpyVACAA%3D%3D/prettify/1/timespan/2026-05-11T12%3a52%3a07.0000000Z%2f2026-05-11T12%3a57%3a07.0000000Z",
              "linkToSearchResultsAPI": "https://api.loganalytics.io/v1/workspaces/8bb8b1ca-9b6e-4af8-afca-6e9f1fda544a/query?query=AzureActivity%7C%20where%20%20CategoryValue%20%3D%3D%20%22ServiceHealth%22&timespan=2026-05-11T12%3a52%3a07.0000000Z%2f2026-05-11T12%3a57%3a07.0000000Z",
              "linkToSearchResultsUI": "https://portal.azure.com#@eca36054-49a9-4731-a42f-8400670fc022/blade/Microsoft_Azure_Monitoring_Logs/LogsBlade/source/Alerts.EmailLinks/scope/%7B%22resources%22%3A%5B%7B%22resourceId%22%3A%22%2Fsubscriptions%2Ff007df01-9295-491c-b0e9-e3981f2df0b0%22%7D%5D%7D/q/eJxzrCotSnVMLsksyyyprFEoz0gtSlVQcE4sSU3PL6oMS8wpTVWwtVVQCk4tKstMTvVITcwpyVACAA%3D%3D/prettify/1/timespan/2026-05-11T12%3a52%3a07.0000000Z%2f2026-05-11T12%3a57%3a07.0000000Z",
              "metricMeasureColumn": null,
              "metricValue": 2.0,
              "operator": "GreaterThan",
              "searchQuery": "AzureActivity| where  CategoryValue == \"ServiceHealth\"\r\n",
              "targetResourceTypes": "['Microsoft.OperationalInsights/workspaces']",
              "threshold": "1",
              "timeAggregation": "Count"
            }
          ],
          "windowEndTime": "2026-05-11T12:57:07Z",
          "windowSize": "PT5M",
          "windowStartTime": "2026-05-11T12:52:07Z"
        },
        "conditionType": "LogQueryCriteria",
        "description": "",
        "id": "/subscriptions/f007df01-9295-491c-b0e9-e3981f2df0b0/resourceGroups/mcprd-rg-vpp-p-res/providers/microsoft.insights/scheduledqueryrules/vpp-resource-unhealthy",
        "name": "vpp-resource-unhealthy",
        "portalLink": "https://portal.azure.com/#resource//subscriptions/f007df01-9295-491c-b0e9-e3981f2df0b0",
        "resourceGroupName": null,
        "resourceId": "/subscriptions/f007df01-9295-491c-b0e9-e3981f2df0b0",
        "resourceName": null,
        "resourceType": null,
        "severity": "0",
        "subscriptionId": "f007df01-9295-491c-b0e9-e3981f2df0b0",
        "timestamp": "2026-05-11T13:12:43.2791416Z"
      },
      "properties": null,
      "status": "Activated",
      "version": "2023-03-15-preview"
    },
    "essentials": {
      "actionStatus": {
        "isSuppressed": false
      },
      "alertRule": "/subscriptions/f007df01-9295-491c-b0e9-e3981f2df0b0/resourceGroups/mcprd-rg-vpp-p-res/providers/microsoft.insights/scheduledqueryrules/vpp-resource-unhealthy",
      "alertState": "Closed",
      "description": "",
      "lastModifiedDateTime": "2026-05-11T15:06:40.5917898+00:00",
      "lastModifiedUserName": "Alex.Torres@eneco.com",
      "monitorCondition": "Fired",
      "monitorService": "Log Alerts V2",
      "severity": "Sev0",
      "signalType": "Log",
      "sourceCreatedId": "22ed515b-24d3-26ce-3fb3-09cfc5158afb",
      "startDateTime": "2026-05-11T13:12:43.2790702Z",
      "targetResource": "/subscriptions/f007df01-9295-491c-b0e9-e3981f2df0b0",
      "targetResourceGroup": "",
      "targetResourceName": "f007df01-9295-491c-b0e9-e3981f2df0b0",
      "targetResourceType": "microsoft.resources/subscriptions"
    }
  },
  "type": "Microsoft.AlertsManagement/alerts"
}
